INSERT INTO product_product

    (name, description, hide, price, discount, "group")

VALUES
    ('Багет пшеничный', 'Состав: мука пшеничная в/с, вода питьевая, закваска пшеничная (мука пшеничная в/с, вода питьевая), дрожжи прессованные, соль поваренная пищевая', false, 38.20, 0.0, 1),
    ('Баранки «Молочные»', 'Состав: мука пшеничная хлебопекарная первый сорт, сахар, масло подсолнечное рафинированное дезодорированное, молоко сухое обезжиренное, соль поваренная пищевая, дрожжи хлебопекарные прессованные', false, 49.0, 0.95, 1),

    ('Сыр «Адыгейский» легкий', 'Состав: молоко пастеризованное, сыворотка молочная, соль пищевая.', false, 290.0, 0.97, 2),
    ('Сыр «Буррата» с соусом песто', 'молоко нормализованное пастеризованное, сливки ультрапастеризованные', false, 290.0, 1.1, 2),

    ('Колбаски «Детские»', 'Состав: свинина, говядина, вода питьевая, продукт яичный (меланж), соль пищевая', false, 175.50, 0.85, 3),
    ('Буженина из мяса индейки', 'Состав: мясо индейки, соль, экстракты черного, зеленого перца, лимона, сельдерея, перец красный, чеснок', false, 1023.70, 0.98, 3),
    ('Говядина тушеная', 'Состав: говядина, жир топленый говяжий, лук репчатый сушеный, соль пищевая, лист лавровый, перец черный молотый', false, 260.0, 0, 3)

;